app/controllers/articles_controller.rb

	def create
		# this method needs to post or save the params returned by the form
		# --------------------------------
		# this renders a plain view in which the params are printed in a hash
		# render plain: params[:article].inspect
		# ---------------------------
		# this returns a security error, we need to specify which params to save
		# @article = Article.new(params[:article])

		# @article.save
		# redirect_to @article
		# -----------------------------------------

		@article = Article.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-14 21:40:26.967121"], ["text", "fghjkl;gh"], ["title", "rtyuiop"], ["updated_at", "2014-09-14 21:40:26.967121"]]

	def show # shows one article
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

	def index #shows all articles
		@articles = Article.all
---
SELECT "articles".* FROM "articles"