app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "awegaweg"], ["commenter", "awgaweg"], ["created_at", "2014-09-15 02:17:07.442095"], ["updated_at", "2014-09-15 02:17:07.442095"]]
---
	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)